1:WizQst719F5
00000000

Find Juma Fasttrack and Laduma Thunderhoof, learn what their problems are, and resolve them!
00000001

You did an excellent job with those upstart Impi Raiders. I have heard two rival lieutenants are now refusing to work together.
00000002

This kind of internal strife is intolerable. We need both tribes to work together.
00000003

Can you talk to Juma Fasttrack and Laduma Thunderhoof and resolve their issues so they will follow orders?
00000004

Hello, outsider. The Queen sent you? Yes, my warriors and I have issues.
00000005

We will not take orders from the Thunderhoofs. Tell the Queen if we cannot lead we will not fight.
00000006

The Queen has a problem with us? Well, we have a problem with our orders. We are far more skilled than Juma's soldiers.
00000007

We must lead the army against the big noses. To do less would be a dishonor. You tell the Queen that!
00000008

The pride of these foolish warriors! Still, we need both of them.
00000009

You think we should give them equal places of honor? Wonderful! You are almost as great a military genius as my husband!
00000010

Suggest to them that each can be one of the "Horns of the Buffalo" in our next strike against the Elephants.
00000011

We can be the the right horn of the "Horns of the Buffalo" against the big noses?
00000012

Yes, that will give us honor! Thank you for your help, outsider.
00000013

The Queen specifically asked for us to be the left horn of the "Horns of the Buffalo"? We cannot refuse such an honor.
00000014

We are ready to fight the big noses. And you will see how the left horn is the better horn!
00000015

Well done, Wizard.
